Autodesk.Revit.DB.ElementIdSetFilter.GetIdsToInclude
Returns the ids of this filter.
Returns:
The collection of ids.
Since:
2021

Autodesk.Revit.DB.ElementIdSetFilter.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Constructs a new instance of a filter wrapping a set of elements.
idsToInclude:
The ids.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input collection of ids was empty, or its contents were not valid for iteration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.ElementIdSetFilter
A filter wrapping a set of elements.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Since:
2021